Repository: VladiStep/AutoPixelArt
Catalog: Resources/Strings.*.resx
Languages: ru

source: debug mode
ru: режим отладки

source: Minutes remaining -
ru: Осталось минут -

# someSettingsDamaged
source: Some settings had invalid values, so they were reset to default values.
ru: Некоторые настройки имели неправильные значения, поэтому они сброшены на значения по умолчанию.

# paletteVer0
source: version
ru: Версия

# paletteVer1
source: Palette
ru: палитры

source: Current layer -
ru: Текущий слой -

source: Start
ru: Запуск

# doneBuilding
source: Done. Minutes passed:
ru: Завершено. Прошло минут:

source: less than one
ru: меньше одной

# imgDamaged
source: Selected file is damaged, or is not an image.
ru: Указанный файл повреждён, или не является картинкой.

source: Width -
ru: Ширина -

source: Height -
ru: Высота -

# colorCount
source: Colors count -
ru: Количество цветов -

# takeMinutes
source: Would take minutes -
ru: Займёт минут -

# chooseVer
source: Choose version...
ru: Выберите версию...

# noPalette
source: There's no palette for older versions. You'll have to pick the blocks yourself.
ru: Для более старых версий палитры не предусмотрено. Вам придётся самим подбирать блоки.

source: Cancel
ru: Отмена

# startSuccess
source: Successfully started.
ru: Успешно запущено.

# toCancelBlock
source: To unblock, press Ctrl + Alt + Delete.
ru: Чтобы отменить блокировку, нажмите Ctrl + Alt + Delete.

# pic
source: Picture
ru: Картинка

source: All files
ru: Все файлы

# openPic
source: Open picture...
ru: Открыть картинку...

# ver
source: Version
ru: Версия

# author
source: Author - Vladislav Stepanov.
ru: Автор - Владислав Степанов.

# settingsReset
source: Settings are reset.
ru: Настройки сброшены.

# readCarefully
source: Read carefully, please.
ru: Читайте внимательнее, пожалуйста.

# invalidNum
source: The number is written incorrectly.
ru: Число записано неверно.

# validPicLayer
source: The number of layer for this picture - from 2 to
ru: Номер слоя для этой картинки - от 2 до

# hideEnabled
source: In the settings, hiding the Minecraft window is turned on.
ru: В настройках включено скрывание окна Minecraf

# langChangeReset
source: Restart the program for the changes to take effect.
ru: Чтобы изменения вступили в силу, перезапустите программу.

# colorsReduced0
source: Number of colors was reduced to
ru: Количество цветов снижено до

# colorsReduced1
source: was -
ru: было -

# reduceError
source: Failed to reduce the number of colors due to an internal error in the ImageSharp library.
ru: Не удалось понизить количество цветов из-за внутренней ошибки библиотеки ImageSharp.

# hiddenFound
source: Found one hidden Minecraft window. Restore?
ru: Найдено скрытое окно Minecraft. Восстановить?

# hiddenFoundSev
source: Found several hidden Minecraft windows. Restore?
ru: Найдено несколько скрытых окон Minecraft. Восстановить?

# hiddenRestored
source: Window restored.
ru: Окно восстановлено.

# hiddenRestoredSev
source: Windows restored.
ru: Окна восстановлены.

# windowLost
source: Lost access to the working Minecraft window.
ru: Пропал доступ к рабочему окну Minecraft.

# unfinishedLayerNum0
source: Unfinished layer number -
ru: Номер недостроенного слоя -

# unfinishedLayerNum1
source: inscribed in "from the layer" continuation text box
ru: вписано в поле продолжения с слоя

# savePic
source: Save picture...
ru: Сохранить картинку...

source: Saved.
ru: Сохранено.

source: Window not found.
ru: Окно не найдено.

# openedSevWindows0
source: Opened two or more Minecraft windows.
ru: Открыто два или более окна Minecraft.

# openedSevWindows1
source: Non-minimized window will be considered the required window.
ru: Нужным окном будет считаться развёрнутое окно.

# openedSevWindows2
source: Minimize unnecessary windows so that only one non-minimized window remains, and click OK.
ru: Сверните лишние окна, чтобы осталось только одно развёрнутое окно, и нажмите ОК.

# stillSevWindows
source: Still see more that one visible Minecraft window.
ru: По-прежнему вижу больше одного видимого окна Minecraft.

# noWindow
source: Can't see any non-minimized Minecraft window.
ru: Не вижу ни одного развёрнутого окна Minecraft.

# blockError0
source: Failed to block keyboard and mouse. Error -
ru: Не удалось заблокировать клавиатуру и мышь. Ошибка -

# blockError1
source: Try to restart the program as administrator. If that doesn't help - report the error to the author of the program.
ru: Попробуйте перезапустить программу от имени администратора. Если не помогло - отправьте ошибку автору программы.

# blockError2
source: Continue without block?
ru: Продолжить без блокировки?

# settingsSaved
source: Settings are saved.
ru: Настройки сохранены.

# vanishWarning
source: If Minecraft window is hidden, you can return it back ONLY WITH THIS PROGRAM (or through the "Task Manager", by stopping Minecraft process "javaw.exe") !
ru: Внимание! Если окно Minecraft скроется, вернуть его назад можно ТОЛЬКО ЭТОЙ ПРОГРАММОЙ (или через "Диспетчер задач", путём остановки процесса Minecraft "javaw.exe") !

source: Countdown
ru: Обратный отсчёт
